test-plans/e2e/webrtc-smoke.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="WebRTC Smoke Test" enabled="true">
      <stringProp name="TestPlan.comments">E2E smoke test against webrtc-signaling-mock - 5 VUs send SDP offers and measure signaling RTT</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SIGNALING_HOST" elementType="Argument">
            <stringProp name="Argument.name">SIGNALING_HOST</stringProp>
            <stringProp name="Argument.value">${__P(webrtc.host,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SIGNALING_PORT" elementType="Argument">
            <stringProp name="Argument.name">SIGNALING_PORT</stringProp>
            <stringProp name="Argument.value">${__P(webrtc.port,8088)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="WebRTC Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- WebRTC Signaling: send SDP offer, receive SDP answer -->
        <WebRTCSampler guiclass="WebRTCSamplerGui" testclass="WebRTCSampler" testname="WebRTC SDP Offer" enabled="true">
          <stringProp name="WebRTCSampler.signalingUrl">http://${SIGNALING_HOST}:${SIGNALING_PORT}/offer</stringProp>
          <stringProp name="WebRTCSampler.offerSdp">generate</stringProp>
          <stringProp name="WebRTCSampler.connectTimeout">10000</stringProp>
        </WebRTCSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert SDP answer contains ICE" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="ice-ufrag">a=ice-ufrag:mock</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert SDP answer has candidate" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="candidate">a=candidate:</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Assert signaling under 5s" enabled="true">
            <stringProp name="DurationAssertion.duration">5000</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <!-- Constant timer between iterations -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>